var good_names = [
  "捞一捞今天中午2号餐厅12点10分左右在打包窗口的黑色裤子米色上衣吧小小的算是对视了一下吧蓝色卫衣的我",
  "捞一捞那个想要一起吃饭一起走路非快餐式恋爱的女生放个小号3411750264",
  "随机抓一个小姐姐搭伙过个520，散散步，吃点东西，放松一下，能出校的那种哦993354756977",
  "捞一个今天下午放学后从B区过桥回C区宿舍那边的女生，扎着马尾，穿着一条红边白底有一个爱心的T恤，灰色的运动长裤，蓝色的高帮鞋和一个绿色的背包。感觉好酷，想问个联系方式。",
  "从来没有过过520/521我不服我不管我想过节找一个男生一起过节鸣鸣鸣鸣鸣鸣）能出校玩最好！！！放一个小号2176212850",
  "捞一捞周四下午7-207操作系统靠窗第二排的女生，我是你前排的男生，，还是太了不敢直接冲，想认识一下！扣291863911",
];
var imgs = ["01.jpg", "01.jpg", "01.jpg", "01.jpg", "01.jpg", "01.jpg"];
var h2 = ["heart.svg"];
var news = [
  "2022/05/20",
  "2022/05/20",
  "2022/05/19",
  "2022/05/19",
  "2022/05/19",
  "2022/05/19",
];
var prices = ["匿名用户", "恋爱", "9", "兔", "我不服我不管", "捞捞捞"];
var hearts = ["♡", "❤", "♡", "♡", "♡", "♡"];
var str = "";
for (var i = 0; i < good_names.length; i++) {
  str += `<div class="good">
 
 
  <h5 class="good_name">${good_names[i]}</h5>
  <img src="img/${imgs[i]}" alt="" />
  <div class="new">${news[i]}</div>
  <h3 class="price">${prices[i]}</h3>
  <h2 class="heart">${hearts[i]}</h2></div>`;
}
$(".goods").html(str);

$(".shaixuan").on("click", () => {
  alert("11");
});
