var good_names = [
  "今天居然被家教的学生气哭了好丢脸但是真的好气啊",
  "考试时间能不能恢复原来啊..亚运会都推迟了，这提前的意义也没了啊。医学性真的会谢。",
  "祝祝偷毕设展厅周边的人这辈子拿不到毕业证个一个",
  "又看到她了，真开心啊！！！",
  "以前不相信有男孩子可以拒绝一个不管是开灯还是关灯且主动的美女（此处省略一万字），直到我有个朋友像个柳下惠一样·....",
  "虽然是看到营销号说的，但有道理要势均力敌男方觉得女方什么都好，什么都宠着爱着女方觉得男方很厉害，有适当的仰慕之情",
];
var imgs = [
  /*  "显卡.jpg",
  "显卡.jpg",
  "显卡.jpg",
  "显卡.jpg",
  "显卡.jpg",
  "显卡.jpg", */
];
var news = [
  "2022/05/19",
  "2022/05/19",
  "2022/05/19",
  "2022/05/19",
  "2022/05/19",
  "2022/05/18",
];
var prices = [
  "好丢脸",
  "医学性",
  "小偷拿不到毕业证",
  "年年",
  "抓耳烧脚的猫",
  "理想情侣相处状态",
];
var str = "";
for (var i = 0; i < good_names.length; i++) {
  str += `<div class="good">
  <img src="img/${imgs[i]}" alt="" />
  <h5 class="good_name">${good_names[i]}</h5>
  <div class="new">${news[i]}</div>
  <h3 class="price">${prices[i]}</h3></div>`;
}
$(".goods").html(str);

$(".shaixuan").on("click", () => {
  alert("11");
});
